app/controllers/v1/guest_controller.rb

SELECT "guests".* FROM "guests"
---
  def index
    @guests = Guest.all

INSERT INTO "guests" ("username", "paymenth_method", "price", "status", "location", "phone_numnber", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @guest = Guest.new(guests_param)
    # @guest = Guest.new(username:"chheng",paymenth_method: "ABA",price:20,status:"pending",location:"pp",phone_number:"983838278282")


    @guest.save